In [1]:
import sqlite3
import pandas as pd
path=r"E:\ds_roadmap\dataset\books_dataset.xlsx"
conn = sqlite3.connect(path)   # opens/creates the .db
conn

In [2]:
import pandas as pd
import sqlite3

# Step 1: Load the Excel file
df_books = pd.read_excel("books_dataset.xlsx")

# Step 2: Connect (or create) SQLite database
conn = sqlite3.connect("books.db")

# Step 3: Save the Excel data as a table named 'books'
df_books.to_sql("books", conn, if_exists="replace", index=False)

# Step 4: Now run your SQL query
df = pd.read_sql_query("SELECT  * FROM books;", conn)
df

,book_id,title,author,genre,year_published,price,rating,publisher,available_copies
0,1,To Kill a Mockingbird,Harper Lee,Fiction,1960,12.99,4.8,J.B. Lippincott & Co.,5
1,2,1984,George Orwell,Dystopian,1949,10.99,4.7,Secker & Warburg,8
2,3,The Great Gatsby,F. Scott Fitzgerald,Classic,1925,11.50,4.6,Charles Scribner's Sons,3
3,4,Pride and Prejudice,Jane Austen,Romance,1813,9.99,4.9,T. Egerton,6
4,5,Moby-Dick,Herman Melville,Adventure,1851,13.99,4.1,Harper & Brothers,4
5,6,The Catcher in the Rye,J.D. Salinger,Fiction,1951,10.50,4.2,"Little, Brown and Company",7
6,7,The Hobbit,J.R.R. Tolkien,Fantasy,1937,15.00,4.9,George Allen & Unwin,10
7,8,Fahrenheit 451,Ray Bradbury,Science Fiction,1953,9.50,4.5,Ballantine Books,9
8,9,Jane Eyre,Charlotte Bronte,Romance,1847,12.00,4.7,"Smith, Elder & Co.",5
9,10,Animal Farm,George Orwell,Satire,1945,8.99,4.8,Secker & Warburg,12
10,11,The Alchemist,Paulo Coelho,Philosophy,1988,14.00,4.6,HarperTorch,11
11,12,The Da Vinci Code,Dan Brown,Thriller,2003,16.50,4.3,Doubleday,14
12,13,Harry Potter and the Sorcerer's Stone,J.K. Rowling,Fantasy,1997,18.99,4.9,Bloomsbury,20
13,14,Brave New World,Aldous Huxley,Dystopian,1932,11.99,4.4,Chatto & Windus,8
14,15,Wuthering Heights,Emily Bronte,Romance,1847,9.50,4.5,Thomas Cautley Newby,6

In [3]:
df=pd.read_sql_query("SELECT  title From books;",conn)
df

                                    title
0                   To Kill a Mockingbird
1                                    1984
2                        The Great Gatsby
3                     Pride and Prejudice
4                               Moby-Dick
5                  The Catcher in the Rye
6                              The Hobbit
7                          Fahrenheit 451
8                               Jane Eyre
9                             Animal Farm
10                          The Alchemist
11                      The Da Vinci Code
12  Harry Potter and the Sorcerer's Stone
13                        Brave New World
14                      Wuthering Heights

In [4]:
df=pd.read_sql_query("SELECT author,title FROM books;",conn)
df

                 author                                  title
0            Harper Lee                  To Kill a Mockingbird
1         George Orwell                                   1984
2   F. Scott Fitzgerald                       The Great Gatsby
3           Jane Austen                    Pride and Prejudice
4       Herman Melville                              Moby-Dick
5         J.D. Salinger                 The Catcher in the Rye
6        J.R.R. Tolkien                             The Hobbit
7          Ray Bradbury                         Fahrenheit 451
8      Charlotte Bronte                              Jane Eyre
9         George Orwell                            Animal Farm
10         Paulo Coelho                          The Alchemist
11            Dan Brown                      The Da Vinci Code
12         J.K. Rowling  Harry Potter and the Sorcerer's Stone
13        Aldous Huxley                        Brave New World
14         Emily Bronte                      Wuthering Heights

In [5]:
df=pd.read_sql_query("SELECT * FROM books Limit 3;",conn)
df

,book_id,title,author,genre,year_published,price,rating,publisher,available_copies
0,1,To Kill a Mockingbird,Harper Lee,Fiction,1960,12.99,4.8,J.B. Lippincott & Co.,5
1,2,1984,George Orwell,Dystopian,1949,10.99,4.7,Secker & Warburg,8
2,3,The Great Gatsby,F. Scott Fitzgerald,Classic,1925,11.50,4.6,Charles Scribner's Sons,3

In [6]:
df=pd.read_sql_query("SELECT  author,title,price FROM books WHERE price > 10.99;",conn)
df

                author                                  title  price
0           Harper Lee                  To Kill a Mockingbird  12.99
1  F. Scott Fitzgerald                       The Great Gatsby  11.50
2      Herman Melville                              Moby-Dick  13.99
3       J.R.R. Tolkien                             The Hobbit  15.00
4     Charlotte Bronte                              Jane Eyre  12.00
5         Paulo Coelho                          The Alchemist  14.00
6            Dan Brown                      The Da Vinci Code  16.50
7         J.K. Rowling  Harry Potter and the Sorcerer's Stone  18.99
8        Aldous Huxley                        Brave New World  11.99

In [7]:
oper=pd.read_sql_query("SELECT author ,title,price,rating From books WHERE (rating > 4.4 or available_copies > 3) AND price > 12.99;",conn)
oper

            author                                  title  price  rating
0  Herman Melville                              Moby-Dick  13.99     4.1
1   J.R.R. Tolkien                             The Hobbit  15.00     4.9
2     Paulo Coelho                          The Alchemist  14.00     4.6
3        Dan Brown                      The Da Vinci Code  16.50     4.3
4     J.K. Rowling  Harry Potter and the Sorcerer's Stone  18.99     4.9

In [8]:
null=pd.read_sql_query("SELECT author,title FROM books WHERE Price IS NOT NULL;",conn)
null

                 author                                  title
0            Harper Lee                  To Kill a Mockingbird
1         George Orwell                                   1984
2   F. Scott Fitzgerald                       The Great Gatsby
3           Jane Austen                    Pride and Prejudice
4       Herman Melville                              Moby-Dick
5         J.D. Salinger                 The Catcher in the Rye
6        J.R.R. Tolkien                             The Hobbit
7          Ray Bradbury                         Fahrenheit 451
8      Charlotte Bronte                              Jane Eyre
9         George Orwell                            Animal Farm
10         Paulo Coelho                          The Alchemist
11            Dan Brown                      The Da Vinci Code
12         J.K. Rowling  Harry Potter and the Sorcerer's Stone
13        Aldous Huxley                        Brave New World
14         Emily Bronte                      Wuthering Heights

In [13]:
like=pd.read_sql_query("SELECT title,author FROM books WHERE title LIKE '%DA%' ;",conn)
like

               title     author
0  The Da Vinci Code  Dan Brown

In [14]:
like=pd.read_sql_query("SELECT title,author FROM books WHERE title LIKE '%LOVE%' ;",conn)
like

Empty DataFrame
Columns: [title, author]
Index: []

In [15]:
like=pd.read_sql_query("SELECT title,author FROM books WHERE title LIKE 'The%' ;",conn)
like

                    title               author
0        The Great Gatsby  F. Scott Fitzgerald
1  The Catcher in the Rye        J.D. Salinger
2              The Hobbit       J.R.R. Tolkien
3           The Alchemist         Paulo Coelho
4       The Da Vinci Code            Dan Brown

In [16]:
like=pd.read_sql_query("SELECT title,author FROM books WHERE title LIKE 'The%Da%' ;",conn)
like

               title     author
0  The Da Vinci Code  Dan Brown

In [20]:
#In case you want to find the Book name whose start with the if yoU write the THE% IT causes minor error becasue it also give the book start as THERE,THEY OR ETC but in the  this formate THE % it gives the correct output#

In [26]:
like=pd.read_sql_query("SELECT title,author FROM books WHERE title LIKE 'The %' ;",conn)
like

                    title               author
0        The Great Gatsby  F. Scott Fitzgerald
1  The Catcher in the Rye        J.D. Salinger
2              The Hobbit       J.R.R. Tolkien
3           The Alchemist         Paulo Coelho
4       The Da Vinci Code            Dan Brown

In [38]:
df = pd.read_sql_query("SELECT title, author FROM books WHERE title LIKE '%G_tsby%';", conn)
df

              title               author
0  The Great Gatsby  F. Scott Fitzgerald

In [40]:
df=pd.read_sql_query("SELECT title ,author,rating FROM books WHERE rating  >=4.4 AND rating <=4.7 ;",conn)
df

               title               author  rating
0               1984        George Orwell     4.7
1   The Great Gatsby  F. Scott Fitzgerald     4.6
2     Fahrenheit 451         Ray Bradbury     4.5
3          Jane Eyre     Charlotte Bronte     4.7
4      The Alchemist         Paulo Coelho     4.6
5    Brave New World        Aldous Huxley     4.4
6  Wuthering Heights         Emily Bronte     4.5

In [42]:
df=pd.read_sql_query("SELECT title ,author,rating FROM books WHERE rating  BETWEEN 4.3 AND 4.6;",conn)
df

               title               author  rating
0   The Great Gatsby  F. Scott Fitzgerald     4.6
1     Fahrenheit 451         Ray Bradbury     4.5
2      The Alchemist         Paulo Coelho     4.6
3  The Da Vinci Code            Dan Brown     4.3
4    Brave New World        Aldous Huxley     4.4
5  Wuthering Heights         Emily Bronte     4.5

In [45]:
df=pd.read_sql_query("SELECT title ,author,rating FROM books  ORDER BY rating DESC",conn)
df

                                    title               author  rating
0                     Pride and Prejudice          Jane Austen     4.9
1                              The Hobbit       J.R.R. Tolkien     4.9
2   Harry Potter and the Sorcerer's Stone         J.K. Rowling     4.9
3                   To Kill a Mockingbird           Harper Lee     4.8
4                             Animal Farm        George Orwell     4.8
5                                    1984        George Orwell     4.7
6                               Jane Eyre     Charlotte Bronte     4.7
7                        The Great Gatsby  F. Scott Fitzgerald     4.6
8                           The Alchemist         Paulo Coelho     4.6
9                          Fahrenheit 451         Ray Bradbury     4.5
10                      Wuthering Heights         Emily Bronte     4.5
11                        Brave New World        Aldous Huxley     4.4
12                      The Da Vinci Code            Dan Brown     4.3
13                 The Catcher in the Rye        J.D. Salinger     4.2
14                              Moby-Dick      Herman Melville     4.1

In [46]:
df=pd.read_sql_query("SELECT title ,author,rating FROM books ORDER BY title DESC ;",conn)
df

                                    title               author  rating
0                       Wuthering Heights         Emily Bronte     4.5
1                   To Kill a Mockingbird           Harper Lee     4.8
2                              The Hobbit       J.R.R. Tolkien     4.9
3                        The Great Gatsby  F. Scott Fitzgerald     4.6
4                       The Da Vinci Code            Dan Brown     4.3
5                  The Catcher in the Rye        J.D. Salinger     4.2
6                           The Alchemist         Paulo Coelho     4.6
7                     Pride and Prejudice          Jane Austen     4.9
8                               Moby-Dick      Herman Melville     4.1
9                               Jane Eyre     Charlotte Bronte     4.7
10  Harry Potter and the Sorcerer's Stone         J.K. Rowling     4.9
11                         Fahrenheit 451         Ray Bradbury     4.5
12                        Brave New World        Aldous Huxley     4.4
13                            Animal Farm        George Orwell     4.8
14                                   1984        George Orwell     4.7

In [48]:
df=pd.read_sql_query("SELECT title ,author,rating,price FROM books ORDER BY rating DESC,Price DESC ;",conn)
df

                                    title               author  rating  price
0   Harry Potter and the Sorcerer's Stone         J.K. Rowling     4.9  18.99
1                              The Hobbit       J.R.R. Tolkien     4.9  15.00
2                     Pride and Prejudice          Jane Austen     4.9   9.99
3                   To Kill a Mockingbird           Harper Lee     4.8  12.99
4                             Animal Farm        George Orwell     4.8   8.99
5                               Jane Eyre     Charlotte Bronte     4.7  12.00
6                                    1984        George Orwell     4.7  10.99
7                           The Alchemist         Paulo Coelho     4.6  14.00
8                        The Great Gatsby  F. Scott Fitzgerald     4.6  11.50
9                          Fahrenheit 451         Ray Bradbury     4.5   9.50
10                      Wuthering Heights         Emily Bronte     4.5   9.50
11                        Brave New World        Aldous Huxley     4.4  11.99
12                      The Da Vinci Code            Dan Brown     4.3  16.50
13                 The Catcher in the Rye        J.D. Salinger     4.2  10.50
14                              Moby-Dick      Herman Melville     4.1  13.99

In [49]:
df=pd.read_sql_query("SELECT title ,author,rating,price FROM books ORDER BY rating DESC,Price ;",conn)
df

                                    title               author  rating  price
0                     Pride and Prejudice          Jane Austen     4.9   9.99
1                              The Hobbit       J.R.R. Tolkien     4.9  15.00
2   Harry Potter and the Sorcerer's Stone         J.K. Rowling     4.9  18.99
3                             Animal Farm        George Orwell     4.8   8.99
4                   To Kill a Mockingbird           Harper Lee     4.8  12.99
5                                    1984        George Orwell     4.7  10.99
6                               Jane Eyre     Charlotte Bronte     4.7  12.00
7                        The Great Gatsby  F. Scott Fitzgerald     4.6  11.50
8                           The Alchemist         Paulo Coelho     4.6  14.00
9                          Fahrenheit 451         Ray Bradbury     4.5   9.50
10                      Wuthering Heights         Emily Bronte     4.5   9.50
11                        Brave New World        Aldous Huxley     4.4  11.99
12                      The Da Vinci Code            Dan Brown     4.3  16.50
13                 The Catcher in the Rye        J.D. Salinger     4.2  10.50
14                              Moby-Dick      Herman Melville     4.1  13.99

In [54]:
agg_func=pd.read_sql_query("SELECT AVG(price) AS RATING  FROM books;",conn)ac
agg_func

      RATING
0  12.428667

In [58]:
agg_func=pd.read_sql_query("SELECT ROUND(AVG(price), 2) AS avg_price FROM books;",conn)
agg_func

   avg_price
0      12.43

In [62]:
agg_func=pd.read_sql_query("SELECT title, AVG(price),Min(rating)  FROM books;",conn)
agg_func

       title  AVG(price)  Min(rating)
0  Moby-Dick   12.428667          4.1

In [63]:
agg_func=pd.read_sql_query("SELECT COUNT(author) FROM books;",conn)
agg_func

   COUNT(author)
0             15

In [66]:
agg_func=pd.read_sql_query("SELECT COUNT(DISTINCT author) FROM books;",conn)
agg_func

   COUNT(DISTINCT author)
0                      14

In [67]:
agg_func=pd.read_sql_query("SELECT author FROM books;",conn)
agg_func

                 author
0            Harper Lee
1         George Orwell
2   F. Scott Fitzgerald
3           Jane Austen
4       Herman Melville
5         J.D. Salinger
6        J.R.R. Tolkien
7          Ray Bradbury
8      Charlotte Bronte
9         George Orwell
10         Paulo Coelho
11            Dan Brown
12         J.K. Rowling
13        Aldous Huxley
14         Emily Bronte

In [4]:
import sqlite3
import pandas as pd

# Connect to your database file (must be in the same folder as your notebook)
conn = sqlite3.connect("books.db")

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

print(" Database connected successfully!")

 Database connected successfully!

In [5]:
df=pd.read_sql_query("SELECT * FROM books;",conn)
df

,book_id,title,author,genre,year_published,price,rating,publisher,available_copies
0,1,To Kill a Mockingbird,Harper Lee,Fiction,1960,12.99,4.8,J.B. Lippincott & Co.,5
1,2,1984,George Orwell,Dystopian,1949,10.99,4.7,Secker & Warburg,8
2,3,The Great Gatsby,F. Scott Fitzgerald,Classic,1925,11.50,4.6,Charles Scribner's Sons,3
3,4,Pride and Prejudice,Jane Austen,Romance,1813,9.99,4.9,T. Egerton,6
4,5,Moby-Dick,Herman Melville,Adventure,1851,13.99,4.1,Harper & Brothers,4
5,6,The Catcher in the Rye,J.D. Salinger,Fiction,1951,10.50,4.2,"Little, Brown and Company",7
6,7,The Hobbit,J.R.R. Tolkien,Fantasy,1937,15.00,4.9,George Allen & Unwin,10
7,8,Fahrenheit 451,Ray Bradbury,Science Fiction,1953,9.50,4.5,Ballantine Books,9
8,9,Jane Eyre,Charlotte Bronte,Romance,1847,12.00,4.7,"Smith, Elder & Co.",5
9,10,Animal Farm,George Orwell,Satire,1945,8.99,4.8,Secker & Warburg,12
10,11,The Alchemist,Paulo Coelho,Philosophy,1988,14.00,4.6,HarperTorch,11
11,12,The Da Vinci Code,Dan Brown,Thriller,2003,16.50,4.3,Doubleday,14
12,13,Harry Potter and the Sorcerer's Stone,J.K. Rowling,Fantasy,1997,18.99,4.9,Bloomsbury,20
13,14,Brave New World,Aldous Huxley,Dystopian,1932,11.99,4.4,Chatto & Windus,8
14,15,Wuthering Heights,Emily Bronte,Romance,1847,9.50,4.5,Thomas Cautley Newby,6

In [6]:
# Query to list all tables
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

# Fetch all results
tables = cursor.fetchall()

print("Tables in the database:")
for table in tables:
    print(table[0])

Tables in the database:
books

In [5]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect(r"E:\ds_roadmap\dataset\updated_books.db")

# View authors table
authors = pd.read_sql_query("SELECT * FROM authors;", conn)
authors

   author_id                name  birth_year nationality
0          1        J.K. Rowling        1965     British
1          2  George R.R. Martin        1948    American
2          3     Haruki Murakami        1949    Japanese

In [24]:
df=pd.read_sql_query("SELECT * FROM publishers;",conn)
df

   publisher_id          name  location
0             1    Bloomsbury    London
1             2  Bantam Books  New York
2             3    Shinchosha     Tokyo

In [29]:
subquery=pd.read_sql_query("""SELECT name,location FROM publishers 
WHERE publisher_id=(
SELECT author_id FROM authors 
WHERE name = 'J.K. Rowling');""",conn)
subquery

         name location
0  Bloomsbury   London

In [7]:
df=pd.read_sql_query("""SELECT category_name FROM categories
WHERE category_id=(
SELECT book_id From books 
WHERE title='A Game of Thrones'
);""",conn)
df

      category_name
0  Literary Fiction

In [9]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect(r"E:\ds_roadmap\dataset\books_authors.db")

In [11]:
df=pd.read_sql_query("SELECT * FROM Author;",conn)
df

   author_id author_name   country
0          1    Ali Khan  Pakistan
1          2  Sara Ahmed        UK
2          3  Ahmed Raza     India
3          4   Zara Noor       USA
4          5  John Smith    Canada

In [12]:
df=pd.read_sql_query("SELECT * FROM Book;",conn)
df

   book_id             book_name        genre
0       10         Python Basics  Programming
1       11         AI Revolution   Technology
2       12  Data Science Secrets      Science
3       13        Creative Minds   Motivation

In [15]:
df=pd.read_sql_query("""SELECT author_name FROM Author WHERE author_id IN (
  SELECT author_id FROM Authored 
  WHERE book_id = (
  SELECT book_id FROM Book WHERE book_name='Python Basics'
  )) ;""",conn)
df

  author_name
0    Ali Khan
1  Sara Ahmed
2  Ahmed Raza

In [19]:
df=pd.read_sql_query("""SELECT author_name FROM Author 
WHERE author_id IN (
    SELECT author_id FROM Authored
    WHERE book_id=(
        SELECT book_id FROM Book
        Where genre= 'Technology'	
));""",conn)
df

  author_name
0  Sara Ahmed
1   Zara Noor

In [1]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect(r"C:\Users\saima\Downloads\sealeopard.db")

In [4]:
df=pd.read_sql_query("SELECT * FROM migrants;",conn)
df

   id  mile            region
0   1   150     Antarctic Bay
1   2   230  South Polar Zone
2   3   180         Ice Ridge
3   4   200      Frozen Shore
4   6   250    Deep South Sea
5   7   300          Icy Gulf
6   8   120        Frozen Bay
7   9   275     Crystal Coast
8  10   400      Snowy Waters

In [5]:
df=pd.read_sql_query("SELECT * FROM migrants;",conn)
df

   id  mile            region
0   1   150     Antarctic Bay
1   2   230  South Polar Zone
2   3   180         Ice Ridge
3   4   200      Frozen Shore
4   6   250    Deep South Sea
5   7   300          Icy Gulf
6   8   120        Frozen Bay
7   9   275     Crystal Coast
8  10   400      Snowy Waters

In [6]:
df=pd.read_sql_query("SELECT * FROM leopards;",conn)
df

   id            name
0   1   Arctic Hunter
1   2      Ocean Claw
2   3    Wave Stalker
3   4      Frost Fang
4   5     Sea Whisper
5   6  Glacier Shadow

In [13]:
df=pd.read_sql_query("SELECT * FROM leopards JOIN migrants ON leopards.id= migrants.id;",conn)
df

   id            name  id  mile            region
0   1   Arctic Hunter   1   150     Antarctic Bay
1   2      Ocean Claw   2   230  South Polar Zone
2   3    Wave Stalker   3   180         Ice Ridge
3   4      Frost Fang   4   200      Frozen Shore
4   6  Glacier Shadow   6   250    Deep South Sea

In [14]:
df=pd.read_sql_query("""SELECT * FROM leopards
LEFT JOIN migrants ON leopards.id= migrants.id;""",conn)
df

   id            name   id   mile            region
0   1   Arctic Hunter  1.0  150.0     Antarctic Bay
1   2      Ocean Claw  2.0  230.0  South Polar Zone
2   3    Wave Stalker  3.0  180.0         Ice Ridge
3   4      Frost Fang  4.0  200.0      Frozen Shore
4   5     Sea Whisper  NaN    NaN              None
5   6  Glacier Shadow  6.0  250.0    Deep South Sea

In [15]:
df=pd.read_sql_query("""SELECT * FROM leopards
RIGHT JOIN migrants ON leopards.id= migrants.id;""",conn)
df

    id            name  id  mile            region
0  1.0   Arctic Hunter   1   150     Antarctic Bay
1  2.0      Ocean Claw   2   230  South Polar Zone
2  3.0    Wave Stalker   3   180         Ice Ridge
3  4.0      Frost Fang   4   200      Frozen Shore
4  6.0  Glacier Shadow   6   250    Deep South Sea
5  NaN            None   7   300          Icy Gulf
6  NaN            None   8   120        Frozen Bay
7  NaN            None   9   275     Crystal Coast
8  NaN            None  10   400      Snowy Waters

In [16]:
df=pd.read_sql_query("""SELECT * FROM leopards
FULL JOIN migrants ON leopards.id= migrants.id;""",conn)
df

    id            name    id   mile            region
0  1.0   Arctic Hunter   1.0  150.0     Antarctic Bay
1  2.0      Ocean Claw   2.0  230.0  South Polar Zone
2  3.0    Wave Stalker   3.0  180.0         Ice Ridge
3  4.0      Frost Fang   4.0  200.0      Frozen Shore
4  5.0     Sea Whisper   NaN    NaN              None
5  6.0  Glacier Shadow   6.0  250.0    Deep South Sea
6  NaN            None   7.0  300.0          Icy Gulf
7  NaN            None   8.0  120.0        Frozen Bay
8  NaN            None   9.0  275.0     Crystal Coast
9  NaN            None  10.0  400.0      Snowy Waters

In [17]:
df=pd.read_sql_query("""SELECT * FROM leopards
INNER JOIN migrants ON leopards.id= migrants.id;""",conn)
df

   id            name  id  mile            region
0   1   Arctic Hunter   1   150     Antarctic Bay
1   2      Ocean Claw   2   230  South Polar Zone
2   3    Wave Stalker   3   180         Ice Ridge
3   4      Frost Fang   4   200      Frozen Shore
4   6  Glacier Shadow   6   250    Deep South Sea

In [20]:
df=pd.read_sql_query("""SELECT * FROM leopards NATURAL JOIN migrants;""",conn)
df

   id            name  mile            region
0   1   Arctic Hunter   150     Antarctic Bay
1   2      Ocean Claw   230  South Polar Zone
2   3    Wave Stalker   180         Ice Ridge
3   4      Frost Fang   200      Frozen Shore
4   6  Glacier Shadow   250    Deep South Sea

In [1]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect(r"C:\Users\saima\Downloads\books (1).db")

In [2]:
df=pd.read_sql_query("SELECT * FROM translators;",conn)
df

   translator_id  translator_name  language
0              1  Haruki Murakami  Japanese
1              2      Emily Brown    French
2              3      Maria Lopez   Spanish
3              4       John Smith   English

In [4]:
df=pd.read_sql_query("SELECT * FROM authors;",conn)
df

   author_id             author_name   country
0          1           George Orwell        UK
1          2  Gabriel Garca Mrquez  Colombia
2          3         Haruki Murakami     Japan
3          4             Jane Austen        UK
4          5              Mark Twain       USA

In [10]:
df=pd.read_sql_query("""SELECT author_name FROM authors
UNION
SELECT translator_name FROM translators;""",
conn)
df

              author_name
0             Emily Brown
1  Gabriel Garca Mrquez
2           George Orwell
3         Haruki Murakami
4             Jane Austen
5              John Smith
6             Maria Lopez
7              Mark Twain

In [11]:
df=pd.read_sql_query("""SELECT author_name FROM authors
INTERSECT
SELECT translator_name FROM translators;""",
conn)
df

       author_name
0  Haruki Murakami

In [12]:
df=pd.read_sql_query("""SELECT author_name FROM authors
EXCEPT
SELECT translator_name FROM translators;""",
conn)
df

              author_name
0  Gabriel Garca Mrquez
1           George Orwell
2             Jane Austen
3              Mark Twain

In [13]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect(r"C:\Users\saima\Downloads\ratings.db")

In [14]:
df=pd.read_sql_query("""
SELECT book_id FROM book_ratings;
""",conn)
df

   book_id
0        1
1        1
2        2
3        3
4        3
5        4
6        5
7        6
8        6

In [15]:
df=pd.read_sql_query("""
SELECT rating FROM book_ratings;
""",conn)
df

   rating
0     4.8
1     4.5
2     4.2
3     4.9
4     5.0
5     4.6
6     4.7
7     4.3
8     4.0

In [23]:
df=pd.read_sql_query("""
SELECT AVG(rating) AS AVERAGE FROM book_ratings
GROUP BY
book_id
HAVING
AVERAGE > 4.2;
""",conn)
df

   AVERAGE
0     4.65
1     4.95
2     4.60
3     4.70

In [25]:
df=pd.read_sql_query("""
SELECT COUNT(rating) AS AVERAGE FROM book_ratings
GROUP BY
book_id
;
""",conn)
df

   AVERAGE
0        2
1        1
2        2
3        1
4        1
5        2